let cities = [
    {
        "text": "اسکو",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "اهر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ایلخچی",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "آبش احمد",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "آذرشهر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "آقکند",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "باسمنج",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "بخشایش",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "بستان آباد",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "بناب",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "بناب جدید",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "تبریز",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ترک",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ترکمانچای",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "تسوج",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "تیکمه داش",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "جلفا",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خاروانا",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خامنه",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خراجو",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خسروشهر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خضرلو",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خمارلو",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "خواجه",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "دوزدوزان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "زرنق",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "زنوز",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "سراب",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "سردرود",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "سهند",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "سیس",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "سیه رود",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "شبستر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "شربیان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "شرفخانه",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "شندآباد",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "صوفیان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "عجب شیر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "قره آغاج",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "کشکسرای",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "کلوانق",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "کلیبر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "کوزه کنان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "گوگان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "لیلان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "مراغه",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "مرند",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ملکان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ملک کیان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ممقان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "مهربان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "میانه",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "نظرکهریزی",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "هادی شهر",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "هرگلان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "هریس",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "هشترود",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "هوراند",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "وایقان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ورزقان",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "یامچی",
        "province": "آذربایجان شرقی"
    },
    {
        "text": "ارومیه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "اشنویه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "ایواوغلی",
        "province": "آذربایجان غربی"
    },
    {
        "text": "آواجیق",
        "province": "آذربایجان غربی"
    },
    {
        "text": "باروق",
        "province": "آذربایجان غربی"
    },
    {
        "text": "بازرگان",
        "province": "آذربایجان غربی"
    },
    {
        "text": "بوکان",
        "province": "آذربایجان غربی"
    },
    {
        "text": "پلدشت",
        "province": "آذربایجان غربی"
    },
    {
        "text": "پیرانشهر",
        "province": "آذربایجان غربی"
    },
    {
        "text": "تازه شهر",
        "province": "آذربایجان غربی"
    },
    {
        "text": "تکاب",
        "province": "آذربایجان غربی"
    },
    {
        "text": "چهاربرج",
        "province": "آذربایجان غربی"
    },
    {
        "text": "خوی",
        "province": "آذربایجان غربی"
    },
    {
        "text": "دیزج دیز",
        "province": "آذربایجان غربی"
    },
    {
        "text": "ربط",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سردشت",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سرو",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سلماس",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سیلوانه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سیمینه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "سیه چشمه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "شاهین دژ",
        "province": "آذربایجان غربی"
    },
    {
        "text": "شوط",
        "province": "آذربایجان غربی"
    },
    {
        "text": "فیرورق",
        "province": "آذربایجان غربی"
    },
    {
        "text": "قره ضیاءالدین",
        "province": "آذربایجان غربی"
    },
    {
        "text": "قطور",
        "province": "آذربایجان غربی"
    },
    {
        "text": "قوشچی",
        "province": "آذربایجان غربی"
    },
    {
        "text": "کشاورز",
        "province": "آذربایجان غربی"
    },
    {
        "text": "گردکشانه",
        "province": "آذربایجان غربی"
    },
    {
        "text": "ماکو",
        "province": "آذربایجان غربی"
    },
    {
        "text": "محمدیار",
        "province": "آذربایجان غربی"
    },
    {
        "text": "محمودآباد",
        "province": "آذربایجان غربی"
    },
    {
        "text": "مهاباد",
        "province": "آذربایجان غربی"
    },
    {
        "text": "میاندوآب",
        "province": "آذربایجان غربی"
    },
    {
        "text": "میرآباد",
        "province": "آذربایجان غربی"
    },
    {
        "text": "نالوس",
        "province": "آذربایجان غربی"
    },
    {
        "text": "نقده",
        "province": "آذربایجان غربی"
    },
    {
        "text": "نوشین",
        "province": "آذربایجان غربی"
    },
    {
        "text": "اردبیل",
        "province": "اردبیل"
    },
    {
        "text": "اصلاندوز",
        "province": "اردبیل"
    },
    {
        "text": "آبی بیگلو",
        "province": "اردبیل"
    },
    {
        "text": "بیله سوار",
        "province": "اردبیل"
    },
    {
        "text": "پارس آباد",
        "province": "اردبیل"
    },
    {
        "text": "تازه کند",
        "province": "اردبیل"
    },
    {
        "text": "تازه کندانگوت",
        "province": "اردبیل"
    },
    {
        "text": "جعفرآباد",
        "province": "اردبیل"
    },
    {
        "text": "خلخال",
        "province": "اردبیل"
    },
    {
        "text": "رضی",
        "province": "اردبیل"
    },
    {
        "text": "سرعین",
        "province": "اردبیل"
    },
    {
        "text": "عنبران",
        "province": "اردبیل"
    },
    {
        "text": "فخرآباد",
        "province": "اردبیل"
    },
    {
        "text": "کلور",
        "province": "اردبیل"
    },
    {
        "text": "کوراییم",
        "province": "اردبیل"
    },
    {
        "text": "گرمی",
        "province": "اردبیل"
    },
    {
        "text": "گیوی",
        "province": "اردبیل"
    },
    {
        "text": "لاهرود",
        "province": "اردبیل"
    },
    {
        "text": "مشگین شهر",
        "province": "اردبیل"
    },
    {
        "text": "نمین",
        "province": "اردبیل"
    },
    {
        "text": "نیر",
        "province": "اردبیل"
    },
    {
        "text": "هشتجین",
        "province": "اردبیل"
    },
    {
        "text": "هیر",
        "province": "اردبیل"
    },
    {
        "text": "ابریشم",
        "province": "اصفهان"
    },
    {
        "text": "ابوزیدآباد",
        "province": "اصفهان"
    },
    {
        "text": "اردستان",
        "province": "اصفهان"
    },
    {
        "text": "اژیه",
        "province": "اصفهان"
    },
    {
        "text": "اصفهان",
        "province": "اصفهان"
    },
    {
        "text": "افوس",
        "province": "اصفهان"
    },
    {
        "text": "انارک",
        "province": "اصفهان"
    },
    {
        "text": "ایمانشهر",
        "province": "اصفهان"
    },
    {
        "text": "آران وبیدگل",
        "province": "اصفهان"
    },
    {
        "text": "بادرود",
        "province": "اصفهان"
    },
    {
        "text": "باغ بهادران",
        "province": "اصفهان"
    },
    {
        "text": "بافران",
        "province": "اصفهان"
    },
    {
        "text": "برزک",
        "province": "اصفهان"
    },
    {
        "text": "برف انبار",
        "province": "اصفهان"
    },
    {
        "text": "بهاران شهر",
        "province": "اصفهان"
    },
    {
        "text": "بهارستان",
        "province": "اصفهان"
    },
    {
        "text": "بوئین و میاندشت",
        "province": "اصفهان"
    },
    {
        "text": "پیربکران",
        "province": "اصفهان"
    },
    {
        "text": "تودشک",
        "province": "اصفهان"
    },
    {
        "text": "تیران",
        "province": "اصفهان"
    },
    {
        "text": "جندق",
        "province": "اصفهان"
    },
    {
        "text": "جوزدان",
        "province": "اصفهان"
    },
    {
        "text": "جوشقان و کامو",
        "province": "اصفهان"
    },
    {
        "text": "چادگان",
        "province": "اصفهان"
    },
    {
        "text": "چرمهین",
        "province": "اصفهان"
    },
    {
        "text": "چمگردان",
        "province": "اصفهان"
    },
    {
        "text": "حبیب آباد",
        "province": "اصفهان"
    },
    {
        "text": "حسن آباد",
        "province": "اصفهان"
    },
    {
        "text": "حنا",
        "province": "اصفهان"
    },
    {
        "text": "خالدآباد",
        "province": "اصفهان"
    },
    {
        "text": "خمینی شهر",
        "province": "اصفهان"
    },
    {
        "text": "خوانسار",
        "province": "اصفهان"
    },
    {
        "text": "خور",
        "province": "اصفهان"
    },
    {
        "text": "خورزوق",
        "province": "اصفهان"
    },
    {
        "text": "داران",
        "province": "اصفهان"
    },
    {
        "text": "دامنه",
        "province": "اصفهان"
    },
    {
        "text": "درچه",
        "province": "اصفهان"
    },
    {
        "text": "دستگرد",
        "province": "اصفهان"
    },
    {
        "text": "دهاقان",
        "province": "اصفهان"
    },
    {
        "text": "دهق",
        "province": "اصفهان"
    },
    {
        "text": "دولت آباد",
        "province": "اصفهان"
    },
    {
        "text": "دیزیچه",
        "province": "اصفهان"
    },
    {
        "text": "رزوه",
        "province": "اصفهان"
    },
    {
        "text": "رضوانشهر",
        "province": "اصفهان"
    },
    {
        "text": "زاینده رود",
        "province": "اصفهان"
    },
    {
        "text": "زرین شهر",
        "province": "اصفهان"
    },
    {
        "text": "زواره",
        "province": "اصفهان"
    },
    {
        "text": "زیباشهر",
        "province": "اصفهان"
    },
    {
        "text": "سده لنجان",
        "province": "اصفهان"
    },
    {
        "text": "سفیدشهر",
        "province": "اصفهان"
    },
    {
        "text": "سگزی",
        "province": "اصفهان"
    },
    {
        "text": "سمیرم",
        "province": "اصفهان"
    },
    {
        "text": "شاهین شهر",
        "province": "اصفهان"
    },
    {
        "text": "شهرضا",
        "province": "اصفهان"
    },
    {
        "text": "طالخونچه",
        "province": "اصفهان"
    },
    {
        "text": "عسگران",
        "province": "اصفهان"
    },
    {
        "text": "علویجه",
        "province": "اصفهان"
    },
    {
        "text": "فرخی",
        "province": "اصفهان"
    },
    {
        "text": "فریدونشهر",
        "province": "اصفهان"
    },
    {
        "text": "فلاورجان",
        "province": "اصفهان"
    },
    {
        "text": "فولادشهر",
        "province": "اصفهان"
    },
    {
        "text": "قمصر",
        "province": "اصفهان"
    },
    {
        "text": "قهجاورستان",
        "province": "اصفهان"
    },
    {
        "text": "قهدریجان",
        "province": "اصفهان"
    },
    {
        "text": "کاشان",
        "province": "اصفهان"
    },
    {
        "text": "کرکوند",
        "province": "اصفهان"
    },
    {
        "text": "کلیشاد و سودرجان",
        "province": "اصفهان"
    },
    {
        "text": "کمشچه",
        "province": "اصفهان"
    },
    {
        "text": "کمه",
        "province": "اصفهان"
    },
    {
        "text": "کهریزسنگ",
        "province": "اصفهان"
    },
    {
        "text": "کوشک",
        "province": "اصفهان"
    },
    {
        "text": "کوهپایه",
        "province": "اصفهان"
    },
    {
        "text": "گرگاب",
        "province": "اصفهان"
    },
    {
        "text": "گزبرخوار",
        "province": "اصفهان"
    },
    {
        "text": "گلپایگان",
        "province": "اصفهان"
    },
    {
        "text": "گلدشت",
        "province": "اصفهان"
    },
    {
        "text": "گلشهر",
        "province": "اصفهان"
    },
    {
        "text": "گوگد",
        "province": "اصفهان"
    },
    {
        "text": "لای بید",
        "province": "اصفهان"
    },
    {
        "text": "مبارکه",
        "province": "اصفهان"
    },
    {
        "text": "مجلسی",
        "province": "اصفهان"
    },
    {
        "text": "محمدآباد",
        "province": "اصفهان"
    },
    {
        "text": "مشکات",
        "province": "اصفهان"
    },
    {
        "text": "منظریه",
        "province": "اصفهان"
    },
    {
        "text": "مهاباد",
        "province": "اصفهان"
    },
    {
        "text": "میمه",
        "province": "اصفهان"
    },
    {
        "text": "نائین",
        "province": "اصفهان"
    },
    {
        "text": "نجف آباد",
        "province": "اصفهان"
    },
    {
        "text": "نصرآباد",
        "province": "اصفهان"
    },
    {
        "text": "نطنز",
        "province": "اصفهان"
    },
    {
        "text": "نوش آباد",
        "province": "اصفهان"
    },
    {
        "text": "نیاسر",
        "province": "اصفهان"
    },
    {
        "text": "نیک آباد",
        "province": "اصفهان"
    },
    {
        "text": "هرند",
        "province": "اصفهان"
    },
    {
        "text": "ورزنه",
        "province": "اصفهان"
    },
    {
        "text": "ورنامخواست",
        "province": "اصفهان"
    },
    {
        "text": "وزوان",
        "province": "اصفهان"
    },
    {
        "text": "ونک",
        "province": "اصفهان"
    },
    {
        "text": "اسارا",
        "province": "البرز"
    },
    {
        "text": "اشتهارد",
        "province": "البرز"
    },
    {
        "text": "تنکمان",
        "province": "البرز"
    },
    {
        "text": "چهارباغ",
        "province": "البرز"
    },
    {
        "text": "سعید آباد",
        "province": "البرز"
    },
    {
        "text": "شهر جدید هشتگرد",
        "province": "البرز"
    },
    {
        "text": "طالقان",
        "province": "البرز"
    },
    {
        "text": "کرج",
        "province": "البرز"
    },
    {
        "text": "کمال شهر",
        "province": "البرز"
    },
    {
        "text": "کوهسار",
        "province": "البرز"
    },
    {
        "text": "گرمدره",
        "province": "البرز"
    },
    {
        "text": "ماهدشت",
        "province": "البرز"
    },
    {
        "text": "محمدشهر",
        "province": "البرز"
    },
    {
        "text": "مشکین دشت",
        "province": "البرز"
    },
    {
        "text": "نظرآباد",
        "province": "البرز"
    },
    {
        "text": "هشتگرد",
        "province": "البرز"
    },
    {
        "text": "ارکواز",
        "province": "ایلام"
    },
    {
        "text": "ایلام",
        "province": "ایلام"
    },
    {
        "text": "ایوان",
        "province": "ایلام"
    },
    {
        "text": "آبدانان",
        "province": "ایلام"
    },
    {
        "text": "آسمان آباد",
        "province": "ایلام"
    },
    {
        "text": "بدره",
        "province": "ایلام"
    },
    {
        "text": "پهله",
        "province": "ایلام"
    },
    {
        "text": "توحید",
        "province": "ایلام"
    },
    {
        "text": "چوار",
        "province": "ایلام"
    },
    {
        "text": "دره شهر",
        "province": "ایلام"
    },
    {
        "text": "دلگشا",
        "province": "ایلام"
    },
    {
        "text": "دهلران",
        "province": "ایلام"
    },
    {
        "text": "زرنه",
        "province": "ایلام"
    },
    {
        "text": "سراب باغ",
        "province": "ایلام"
    },
    {
        "text": "سرابله",
        "province": "ایلام"
    },
    {
        "text": "صالح آباد",
        "province": "ایلام"
    },
    {
        "text": "لومار",
        "province": "ایلام"
    },
    {
        "text": "مهران",
        "province": "ایلام"
    },
    {
        "text": "مورموری",
        "province": "ایلام"
    },
    {
        "text": "موسیان",
        "province": "ایلام"
    },
    {
        "text": "میمه",
        "province": "ایلام"
    },
    {
        "text": "امام حسن",
        "province": "بوشهر"
    },
    {
        "text": "انارستان",
        "province": "بوشهر"
    },
    {
        "text": "اهرم",
        "province": "بوشهر"
    },
    {
        "text": "آب پخش",
        "province": "بوشهر"
    },
    {
        "text": "آبدان",
        "province": "بوشهر"
    },
    {
        "text": "برازجان",
        "province": "بوشهر"
    },
    {
        "text": "بردخون",
        "province": "بوشهر"
    },
    {
        "text": "بندردیر",
        "province": "بوشهر"
    },
    {
        "text": "بندردیلم",
        "province": "بوشهر"
    },
    {
        "text": "بندرریگ",
        "province": "بوشهر"
    },
    {
        "text": "بندرکنگان",
        "province": "بوشهر"
    },
    {
        "text": "بندرگناوه",
        "province": "بوشهر"
    },
    {
        "text": "بنک",
        "province": "بوشهر"
    },
    {
        "text": "بوشهر",
        "province": "بوشهر"
    },
    {
        "text": "تنگ ارم",
        "province": "بوشهر"
    },
    {
        "text": "جم",
        "province": "بوشهر"
    },
    {
        "text": "چغادک",
        "province": "بوشهر"
    },
    {
        "text": "خارک",
        "province": "بوشهر"
    },
    {
        "text": "خورموج",
        "province": "بوشهر"
    },
    {
        "text": "دالکی",
        "province": "بوشهر"
    },
    {
        "text": "دلوار",
        "province": "بوشهر"
    },
    {
        "text": "ریز",
        "province": "بوشهر"
    },
    {
        "text": "سعدآباد",
        "province": "بوشهر"
    },
    {
        "text": "سیراف",
        "province": "بوشهر"
    },
    {
        "text": "شبانکاره",
        "province": "بوشهر"
    },
    {
        "text": "شنبه",
        "province": "بوشهر"
    },
    {
        "text": "عسلویه",
        "province": "بوشهر"
    },
    {
        "text": "کاکی",
        "province": "بوشهر"
    },
    {
        "text": "کلمه",
        "province": "بوشهر"
    },
    {
        "text": "نخل تقی",
        "province": "بوشهر"
    },
    {
        "text": "وحدتیه",
        "province": "بوشهر"
    },
    {
        "text": "ارجمند",
        "province": "تهران"
    },
    {
        "text": "اسلامشهر",
        "province": "تهران"
    },
    {
        "text": "اندیشه",
        "province": "تهران"
    },
    {
        "text": "آبسرد",
        "province": "تهران"
    },
    {
        "text": "آبعلی",
        "province": "تهران"
    },
    {
        "text": "باغستان",
        "province": "تهران"
    },
    {
        "text": "باقرشهر",
        "province": "تهران"
    },
    {
        "text": "بومهن",
        "province": "تهران"
    },
    {
        "text": "پاکدشت",
        "province": "تهران"
    },
    {
        "text": "پردیس",
        "province": "تهران"
    },
    {
        "text": "پیشوا",
        "province": "تهران"
    },
    {
        "text": "تهران",
        "province": "تهران"
    },
    {
        "text": "جوادآباد",
        "province": "تهران"
    },
    {
        "text": "چهاردانگه",
        "province": "تهران"
    },
    {
        "text": "حسن آباد",
        "province": "تهران"
    },
    {
        "text": "دماوند",
        "province": "تهران"
    },
    {
        "text": "دیزین",
        "province": "تهران"
    },
    {
        "text": "شهر ری",
        "province": "تهران"
    },
    {
        "text": "رباط کریم",
        "province": "تهران"
    },
    {
        "text": "رودهن",
        "province": "تهران"
    },
    {
        "text": "شاهدشهر",
        "province": "تهران"
    },
    {
        "text": "شریف آباد",
        "province": "تهران"
    },
    {
        "text": "شمشک",
        "province": "تهران"
    },
    {
        "text": "شهریار",
        "province": "تهران"
    },
    {
        "text": "صالح آباد",
        "province": "تهران"
    },
    {
        "text": "صباشهر",
        "province": "تهران"
    },
    {
        "text": "صفادشت",
        "province": "تهران"
    },
    {
        "text": "فردوسیه",
        "province": "تهران"
    },
    {
        "text": "فشم",
        "province": "تهران"
    },
    {
        "text": "فیروزکوه",
        "province": "تهران"
    },
    {
        "text": "قدس",
        "province": "تهران"
    },
    {
        "text": "قرچک",
        "province": "تهران"
    },
    {
        "text": "کهریزک",
        "province": "تهران"
    },
    {
        "text": "کیلان",
        "province": "تهران"
    },
    {
        "text": "گلستان",
        "province": "تهران"
    },
    {
        "text": "لواسان",
        "province": "تهران"
    },
    {
        "text": "ملارد",
        "province": "تهران"
    },
    {
        "text": "میگون",
        "province": "تهران"
    },
    {
        "text": "نسیم شهر",
        "province": "تهران"
    },
    {
        "text": "نصیرآباد",
        "province": "تهران"
    },
    {
        "text": "وحیدیه",
        "province": "تهران"
    },
    {
        "text": "ورامین",
        "province": "تهران"
    },
    {
        "text": "اردل",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "آلونی",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "باباحیدر",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "بروجن",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "بلداجی",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "بن",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "جونقان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "چلگرد",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "سامان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "سفیددشت",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "سودجان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "سورشجان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "شلمزار",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "شهرکرد",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "طاقانک",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "فارسان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "فرادنبه",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "فرخ شهر",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "کیان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "گندمان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "گهرو",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "لردگان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "مال خلیفه",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "ناغان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "نافچ",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "نقنه",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "هفشجان",
        "province": "چهارمحال و بختیاری"
    },
    {
        "text": "ارسک",
        "province": "خراسان جنوبی"
    },
    {
        "text": "اسدیه",
        "province": "خراسان جنوبی"
    },
    {
        "text": "اسفدن",
        "province": "خراسان جنوبی"
    },
    {
        "text": "اسلامیه",
        "province": "خراسان جنوبی"
    },
    {
        "text": "آرین شهر",
        "province": "خراسان جنوبی"
    },
    {
        "text": "آیسک",
        "province": "خراسان جنوبی"
    },
    {
        "text": "بشرویه",
        "province": "خراسان جنوبی"
    },
    {
        "text": "بیرجند",
        "province": "خراسان جنوبی"
    },
    {
        "text": "حاجی آباد",
        "province": "خراسان جنوبی"
    },
    {
        "text": "خضری دشت بیاض",
        "province": "خراسان جنوبی"
    },
    {
        "text": "خوسف",
        "province": "خراسان جنوبی"
    },
    {
        "text": "زهان",
        "province": "خراسان جنوبی"
    },
    {
        "text": "سرایان",
        "province": "خراسان جنوبی"
    },
    {
        "text": "سربیشه",
        "province": "خراسان جنوبی"
    },
    {
        "text": "سه قلعه",
        "province": "خراسان جنوبی"
    },
    {
        "text": "شوسف",
        "province": "خراسان جنوبی"
    },
    {
        "text": "طبس ",
        "province": "خراسان جنوبی"
    },
    {
        "text": "فردوس",
        "province": "خراسان جنوبی"
    },
    {
        "text": "قاین",
        "province": "خراسان جنوبی"
    },
    {
        "text": "قهستان",
        "province": "خراسان جنوبی"
    },
    {
        "text": "محمدشهر",
        "province": "خراسان جنوبی"
    },
    {
        "text": "مود",
        "province": "خراسان جنوبی"
    },
    {
        "text": "نهبندان",
        "province": "خراسان جنوبی"
    },
    {
        "text": "نیمبلوک",
        "province": "خراسان جنوبی"
    },
    {
        "text": "احمدآباد صولت",
        "province": "خراسان رضوی"
    },
    {
        "text": "انابد",
        "province": "خراسان رضوی"
    },
    {
        "text": "باجگیران",
        "province": "خراسان رضوی"
    },
    {
        "text": "باخرز",
        "province": "خراسان رضوی"
    },
    {
        "text": "بار",
        "province": "خراسان رضوی"
    },
    {
        "text": "بایگ",
        "province": "خراسان رضوی"
    },
    {
        "text": "بجستان",
        "province": "خراسان رضوی"
    },
    {
        "text": "بردسکن",
        "province": "خراسان رضوی"
    },
    {
        "text": "بیدخت",
        "province": "خراسان رضوی"
    },
    {
        "text": "تایباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "تربت جام",
        "province": "خراسان رضوی"
    },
    {
        "text": "تربت حیدریه",
        "province": "خراسان رضوی"
    },
    {
        "text": "جغتای",
        "province": "خراسان رضوی"
    },
    {
        "text": "جنگل",
        "province": "خراسان رضوی"
    },
    {
        "text": "چاپشلو",
        "province": "خراسان رضوی"
    },
    {
        "text": "چکنه",
        "province": "خراسان رضوی"
    },
    {
        "text": "چناران",
        "province": "خراسان رضوی"
    },
    {
        "text": "خرو",
        "province": "خراسان رضوی"
    },
    {
        "text": "خلیل آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "خواف",
        "province": "خراسان رضوی"
    },
    {
        "text": "داورزن",
        "province": "خراسان رضوی"
    },
    {
        "text": "درگز",
        "province": "خراسان رضوی"
    },
    {
        "text": "در رود",
        "province": "خراسان رضوی"
    },
    {
        "text": "دولت آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "رباط سنگ",
        "province": "خراسان رضوی"
    },
    {
        "text": "رشتخوار",
        "province": "خراسان رضوی"
    },
    {
        "text": "رضویه",
        "province": "خراسان رضوی"
    },
    {
        "text": "روداب",
        "province": "خراسان رضوی"
    },
    {
        "text": "ریوش",
        "province": "خراسان رضوی"
    },
    {
        "text": "سبزوار",
        "province": "خراسان رضوی"
    },
    {
        "text": "سرخس",
        "province": "خراسان رضوی"
    },
    {
        "text": "سفیدسنگ",
        "province": "خراسان رضوی"
    },
    {
        "text": "سلامی",
        "province": "خراسان رضوی"
    },
    {
        "text": "سلطان آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "سنگان",
        "province": "خراسان رضوی"
    },
    {
        "text": "شادمهر",
        "province": "خراسان رضوی"
    },
    {
        "text": "شاندیز",
        "province": "خراسان رضوی"
    },
    {
        "text": "ششتمد",
        "province": "خراسان رضوی"
    },
    {
        "text": "شهرآباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "شهرزو",
        "province": "خراسان رضوی"
    },
    {
        "text": "صالح آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "طرقبه",
        "province": "خراسان رضوی"
    },
    {
        "text": "عشق آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "فرهادگرد",
        "province": "خراسان رضوی"
    },
    {
        "text": "فریمان",
        "province": "خراسان رضوی"
    },
    {
        "text": "فیروزه",
        "province": "خراسان رضوی"
    },
    {
        "text": "فیض آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "قاسم آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "قدمگاه",
        "province": "خراسان رضوی"
    },
    {
        "text": "قلندرآباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "قوچان",
        "province": "خراسان رضوی"
    },
    {
        "text": "کاخک",
        "province": "خراسان رضوی"
    },
    {
        "text": "کاریز",
        "province": "خراسان رضوی"
    },
    {
        "text": "کاشمر",
        "province": "خراسان رضوی"
    },
    {
        "text": "کدکن",
        "province": "خراسان رضوی"
    },
    {
        "text": "کلات",
        "province": "خراسان رضوی"
    },
    {
        "text": "کندر",
        "province": "خراسان رضوی"
    },
    {
        "text": "گلمکان",
        "province": "خراسان رضوی"
    },
    {
        "text": "گناباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "لطف آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "مزدآوند",
        "province": "خراسان رضوی"
    },
    {
        "text": "مشهد",
        "province": "خراسان رضوی"
    },
    {
        "text": "ملک آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "نشتیفان",
        "province": "خراسان رضوی"
    },
    {
        "text": "نصرآباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "نقاب",
        "province": "خراسان رضوی"
    },
    {
        "text": "نوخندان",
        "province": "خراسان رضوی"
    },
    {
        "text": "نیشابور",
        "province": "خراسان رضوی"
    },
    {
        "text": "نیل شهر",
        "province": "خراسان رضوی"
    },
    {
        "text": "همت آباد",
        "province": "خراسان رضوی"
    },
    {
        "text": "یونسی",
        "province": "خراسان رضوی"
    },
    {
        "text": "اسفراین",
        "province": "خراسان شمالی"
    },
    {
        "text": "ایور",
        "province": "خراسان شمالی"
    },
    {
        "text": "آشخانه",
        "province": "خراسان شمالی"
    },
    {
        "text": "بجنورد",
        "province": "خراسان شمالی"
    },
    {
        "text": "پیش قلعه",
        "province": "خراسان شمالی"
    },
    {
        "text": "تیتکانلو",
        "province": "خراسان شمالی"
    },
    {
        "text": "جاجرم",
        "province": "خراسان شمالی"
    },
    {
        "text": "حصارگرمخان",
        "province": "خراسان شمالی"
    },
    {
        "text": "درق",
        "province": "خراسان شمالی"
    },
    {
        "text": "راز",
        "province": "خراسان شمالی"
    },
    {
        "text": "سنخواست",
        "province": "خراسان شمالی"
    },
    {
        "text": "شوقان",
        "province": "خراسان شمالی"
    },
    {
        "text": "شیروان",
        "province": "خراسان شمالی"
    },
    {
        "text": "صفی آباد",
        "province": "خراسان شمالی"
    },
    {
        "text": "فاروج",
        "province": "خراسان شمالی"
    },
    {
        "text": "قاضی",
        "province": "خراسان شمالی"
    },
    {
        "text": "گرمه",
        "province": "خراسان شمالی"
    },
    {
        "text": "لوجلی",
        "province": "خراسان شمالی"
    },
    {
        "text": "اروندکنار",
        "province": "خوزستان"
    },
    {
        "text": "الوان",
        "province": "خوزستان"
    },
    {
        "text": "امیدیه",
        "province": "خوزستان"
    },
    {
        "text": "اندیمشک",
        "province": "خوزستان"
    },
    {
        "text": "اهواز",
        "province": "خوزستان"
    },
    {
        "text": "ایذه",
        "province": "خوزستان"
    },
    {
        "text": "آبادان",
        "province": "خوزستان"
    },
    {
        "text": "آغاجاری",
        "province": "خوزستان"
    },
    {
        "text": "باغ ملک",
        "province": "خوزستان"
    },
    {
        "text": "بستان",
        "province": "خوزستان"
    },
    {
        "text": "بندرامام خمینی",
        "province": "خوزستان"
    },
    {
        "text": "بندرماهشهر",
        "province": "خوزستان"
    },
    {
        "text": "بهبهان",
        "province": "خوزستان"
    },
    {
        "text": "ترکالکی",
        "province": "خوزستان"
    },
    {
        "text": "جایزان",
        "province": "خوزستان"
    },
    {
        "text": "چمران",
        "province": "خوزستان"
    },
    {
        "text": "چویبده",
        "province": "خوزستان"
    },
    {
        "text": "حر",
        "province": "خوزستان"
    },
    {
        "text": "حسینیه",
        "province": "خوزستان"
    },
    {
        "text": "حمزه",
        "province": "خوزستان"
    },
    {
        "text": "حمیدیه",
        "province": "خوزستان"
    },
    {
        "text": "خرمشهر",
        "province": "خوزستان"
    },
    {
        "text": "دارخوین",
        "province": "خوزستان"
    },
    {
        "text": "دزآب",
        "province": "خوزستان"
    },
    {
        "text": "دزفول",
        "province": "خوزستان"
    },
    {
        "text": "دهدز",
        "province": "خوزستان"
    },
    {
        "text": "رامشیر",
        "province": "خوزستان"
    },
    {
        "text": "رامهرمز",
        "province": "خوزستان"
    },
    {
        "text": "رفیع",
        "province": "خوزستان"
    },
    {
        "text": "زهره",
        "province": "خوزستان"
    },
    {
        "text": "سالند",
        "province": "خوزستان"
    },
    {
        "text": "سردشت",
        "province": "خوزستان"
    },
    {
        "text": "سوسنگرد",
        "province": "خوزستان"
    },
    {
        "text": "شادگان",
        "province": "خوزستان"
    },
    {
        "text": "شاوور",
        "province": "خوزستان"
    },
    {
        "text": "شرافت",
        "province": "خوزستان"
    },
    {
        "text": "شوش",
        "province": "خوزستان"
    },
    {
        "text": "شوشتر",
        "province": "خوزستان"
    },
    {
        "text": "شیبان",
        "province": "خوزستان"
    },
    {
        "text": "صالح شهر",
        "province": "خوزستان"
    },
    {
        "text": "صفی آباد",
        "province": "خوزستان"
    },
    {
        "text": "صیدون",
        "province": "خوزستان"
    },
    {
        "text": "قلعه تل",
        "province": "خوزستان"
    },
    {
        "text": "قلعه خواجه",
        "province": "خوزستان"
    },
    {
        "text": "گتوند",
        "province": "خوزستان"
    },
    {
        "text": "لالی",
        "province": "خوزستان"
    },
    {
        "text": "مسجدسلیمان",
        "province": "خوزستان"
    },
    {
        "text": "ملاثانی",
        "province": "خوزستان"
    },
    {
        "text": "میانرود",
        "province": "خوزستان"
    },
    {
        "text": "مینوشهر",
        "province": "خوزستان"
    },
    {
        "text": "هفتگل",
        "province": "خوزستان"
    },
    {
        "text": "هندیجان",
        "province": "خوزستان"
    },
    {
        "text": "هویزه",
        "province": "خوزستان"
    },
    {
        "text": "ویس",
        "province": "خوزستان"
    },
    {
        "text": "ابهر",
        "province": "زنجان"
    },
    {
        "text": "ارمغان خانه",
        "province": "زنجان"
    },
    {
        "text": "آب بر",
        "province": "زنجان"
    },
    {
        "text": "چورزق",
        "province": "زنجان"
    },
    {
        "text": "حلب",
        "province": "زنجان"
    },
    {
        "text": "خرمدره",
        "province": "زنجان"
    },
    {
        "text": "دندی",
        "province": "زنجان"
    },
    {
        "text": "زرین آباد",
        "province": "زنجان"
    },
    {
        "text": "زرین رود",
        "province": "زنجان"
    },
    {
        "text": "زنجان",
        "province": "زنجان"
    },
    {
        "text": "سجاس",
        "province": "زنجان"
    },
    {
        "text": "سلطانیه",
        "province": "زنجان"
    },
    {
        "text": "سهرورد",
        "province": "زنجان"
    },
    {
        "text": "صائین قلعه",
        "province": "زنجان"
    },
    {
        "text": "قیدار",
        "province": "زنجان"
    },
    {
        "text": "گرماب",
        "province": "زنجان"
    },
    {
        "text": "ماه نشان",
        "province": "زنجان"
    },
    {
        "text": "هیدج",
        "province": "زنجان"
    },
    {
        "text": "امیریه",
        "province": "سمنان"
    },
    {
        "text": "ایوانکی",
        "province": "سمنان"
    },
    {
        "text": "آرادان",
        "province": "سمنان"
    },
    {
        "text": "بسطام",
        "province": "سمنان"
    },
    {
        "text": "بیارجمند",
        "province": "سمنان"
    },
    {
        "text": "دامغان",
        "province": "سمنان"
    },
    {
        "text": "درجزین",
        "province": "سمنان"
    },
    {
        "text": "دیباج",
        "province": "سمنان"
    },
    {
        "text": "سرخه",
        "province": "سمنان"
    },
    {
        "text": "سمنان",
        "province": "سمنان"
    },
    {
        "text": "شاهرود",
        "province": "سمنان"
    },
    {
        "text": "شهمیرزاد",
        "province": "سمنان"
    },
    {
        "text": "کلاته خیج",
        "province": "سمنان"
    },
    {
        "text": "گرمسار",
        "province": "سمنان"
    },
    {
        "text": "مجن",
        "province": "سمنان"
    },
    {
        "text": "مهدی شهر",
        "province": "سمنان"
    },
    {
        "text": "میامی",
        "province": "سمنان"
    },
    {
        "text": "ادیمی",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "اسپکه",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "ایرانشهر",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "بزمان",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "بمپور",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "بنت",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "بنجار",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "پیشین",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "جالق",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "چابهار",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "خاش",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "دوست محمد",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "راسک",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "زابل",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "زابلی",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "زاهدان",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "زهک",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "سراوان",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "سرباز",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "سوران",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "سیرکان",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "علی اکبر",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "فنوج",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "قصرقند",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "کنارک",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "گشت",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "گلمورتی",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "محمدان",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "محمدآباد",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "محمدی",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "میرجاوه",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "نصرت آباد",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "نگور",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "نوک آباد",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "نیک شهر",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "هیدوچ",
        "province": "سیستان و بلوچستان"
    },
    {
        "text": "اردکان",
        "province": "فارس"
    },
    {
        "text": "ارسنجان",
        "province": "فارس"
    },
    {
        "text": "استهبان",
        "province": "فارس"
    },
    {
        "text": "اشکنان",
        "province": "فارس"
    },
    {
        "text": "افزر",
        "province": "فارس"
    },
    {
        "text": "اقلید",
        "province": "فارس"
    },
    {
        "text": "امام شهر",
        "province": "فارس"
    },
    {
        "text": "اهل",
        "province": "فارس"
    },
    {
        "text": "اوز",
        "province": "فارس"
    },
    {
        "text": "ایج",
        "province": "فارس"
    },
    {
        "text": "ایزدخواست",
        "province": "فارس"
    },
    {
        "text": "آباده",
        "province": "فارس"
    },
    {
        "text": "آباده طشک",
        "province": "فارس"
    },
    {
        "text": "باب انار",
        "province": "فارس"
    },
    {
        "text": "بالاده",
        "province": "فارس"
    },
    {
        "text": "بنارویه",
        "province": "فارس"
    },
    {
        "text": "بهمن",
        "province": "فارس"
    },
    {
        "text": "بوانات",
        "province": "فارس"
    },
    {
        "text": "بیرم",
        "province": "فارس"
    },
    {
        "text": "بیضا",
        "province": "فارس"
    },
    {
        "text": "جنت شهر",
        "province": "فارس"
    },
    {
        "text": "جهرم",
        "province": "فارس"
    },
    {
        "text": "جویم",
        "province": "فارس"
    },
    {
        "text": "زرین دشت",
        "province": "فارس"
    },
    {
        "text": "حسن آباد",
        "province": "فارس"
    },
    {
        "text": "خان زنیان",
        "province": "فارس"
    },
    {
        "text": "خاوران",
        "province": "فارس"
    },
    {
        "text": "خرامه",
        "province": "فارس"
    },
    {
        "text": "خشت",
        "province": "فارس"
    },
    {
        "text": "خنج",
        "province": "فارس"
    },
    {
        "text": "خور",
        "province": "فارس"
    },
    {
        "text": "داراب",
        "province": "فارس"
    },
    {
        "text": "داریان",
        "province": "فارس"
    },
    {
        "text": "دبیران",
        "province": "فارس"
    },
    {
        "text": "دژکرد",
        "province": "فارس"
    },
    {
        "text": "دهرم",
        "province": "فارس"
    },
    {
        "text": "دوبرجی",
        "province": "فارس"
    },
    {
        "text": "رامجرد",
        "province": "فارس"
    },
    {
        "text": "رونیز",
        "province": "فارس"
    },
    {
        "text": "زاهدشهر",
        "province": "فارس"
    },
    {
        "text": "زرقان",
        "province": "فارس"
    },
    {
        "text": "سده",
        "province": "فارس"
    },
    {
        "text": "سروستان",
        "province": "فارس"
    },
    {
        "text": "سعادت شهر",
        "province": "فارس"
    },
    {
        "text": "سورمق",
        "province": "فارس"
    },
    {
        "text": "سیدان",
        "province": "فارس"
    },
    {
        "text": "ششده",
        "province": "فارس"
    },
    {
        "text": "شهرپیر",
        "province": "فارس"
    },
    {
        "text": "شهرصدرا",
        "province": "فارس"
    },
    {
        "text": "شیراز",
        "province": "فارس"
    },
    {
        "text": "صغاد",
        "province": "فارس"
    },
    {
        "text": "صفاشهر",
        "province": "فارس"
    },
    {
        "text": "علامرودشت",
        "province": "فارس"
    },
    {
        "text": "فدامی",
        "province": "فارس"
    },
    {
        "text": "فراشبند",
        "province": "فارس"
    },
    {
        "text": "فسا",
        "province": "فارس"
    },
    {
        "text": "فیروزآباد",
        "province": "فارس"
    },
    {
        "text": "قائمیه",
        "province": "فارس"
    },
    {
        "text": "قادرآباد",
        "province": "فارس"
    },
    {
        "text": "قطب آباد",
        "province": "فارس"
    },
    {
        "text": "قطرویه",
        "province": "فارس"
    },
    {
        "text": "قیر",
        "province": "فارس"
    },
    {
        "text": "کارزین (فتح آباد)",
        "province": "فارس"
    },
    {
        "text": "کازرون",
        "province": "فارس"
    },
    {
        "text": "کامفیروز",
        "province": "فارس"
    },
    {
        "text": "کره ای",
        "province": "فارس"
    },
    {
        "text": "کنارتخته",
        "province": "فارس"
    },
    {
        "text": "کوار",
        "province": "فارس"
    },
    {
        "text": "گراش",
        "province": "فارس"
    },
    {
        "text": "گله دار",
        "province": "فارس"
    },
    {
        "text": "لار",
        "province": "فارس"
    },
    {
        "text": "لامرد",
        "province": "فارس"
    },
    {
        "text": "لپویی",
        "province": "فارس"
    },
    {
        "text": "لطیفی",
        "province": "فارس"
    },
    {
        "text": "مبارک آباددیز",
        "province": "فارس"
    },
    {
        "text": "مرودشت",
        "province": "فارس"
    },
    {
        "text": "مشکان",
        "province": "فارس"
    },
    {
        "text": "مصیری",
        "province": "فارس"
    },
    {
        "text": "مهر",
        "province": "فارس"
    },
    {
        "text": "میمند",
        "province": "فارس"
    },
    {
        "text": "نوبندگان",
        "province": "فارس"
    },
    {
        "text": "نوجین",
        "province": "فارس"
    },
    {
        "text": "نودان",
        "province": "فارس"
    },
    {
        "text": "نورآباد",
        "province": "فارس"
    },
    {
        "text": "نی ریز",
        "province": "فارس"
    },
    {
        "text": "وراوی",
        "province": "فارس"
    },
    {
        "text": "ارداق",
        "province": "قزوین"
    },
    {
        "text": "اسفرورین",
        "province": "قزوین"
    },
    {
        "text": "اقبالیه",
        "province": "قزوین"
    },
    {
        "text": "الوند",
        "province": "قزوین"
    },
    {
        "text": "آبگرم",
        "province": "قزوین"
    },
    {
        "text": "آبیک",
        "province": "قزوین"
    },
    {
        "text": "آوج",
        "province": "قزوین"
    },
    {
        "text": "بوئین زهرا",
        "province": "قزوین"
    },
    {
        "text": "بیدستان",
        "province": "قزوین"
    },
    {
        "text": "تاکستان",
        "province": "قزوین"
    },
    {
        "text": "خاکعلی",
        "province": "قزوین"
    },
    {
        "text": "خرمدشت",
        "province": "قزوین"
    },
    {
        "text": "دانسفهان",
        "province": "قزوین"
    },
    {
        "text": "رازمیان",
        "province": "قزوین"
    },
    {
        "text": "سگزآباد",
        "province": "قزوین"
    },
    {
        "text": "سیردان",
        "province": "قزوین"
    },
    {
        "text": "شال",
        "province": "قزوین"
    },
    {
        "text": "شریفیه",
        "province": "قزوین"
    },
    {
        "text": "ضیاآباد",
        "province": "قزوین"
    },
    {
        "text": "قزوین",
        "province": "قزوین"
    },
    {
        "text": "کوهین",
        "province": "قزوین"
    },
    {
        "text": "محمدیه",
        "province": "قزوین"
    },
    {
        "text": "محمودآباد نمونه",
        "province": "قزوین"
    },
    {
        "text": "معلم کلایه",
        "province": "قزوین"
    },
    {
        "text": "نرجه",
        "province": "قزوین"
    },
    {
        "text": "جعفریه",
        "province": "قم"
    },
    {
        "text": "دستجرد",
        "province": "قم"
    },
    {
        "text": "سلفچگان",
        "province": "قم"
    },
    {
        "text": "قم",
        "province": "قم"
    },
    {
        "text": "قنوات",
        "province": "قم"
    },
    {
        "text": "کهک",
        "province": "قم"
    },
    {
        "text": "آرمرده",
        "province": "کردستان"
    },
    {
        "text": "بابارشانی",
        "province": "کردستان"
    },
    {
        "text": "بانه",
        "province": "کردستان"
    },
    {
        "text": "بلبان آباد",
        "province": "کردستان"
    },
    {
        "text": "بوئین سفلی",
        "province": "کردستان"
    },
    {
        "text": "بیجار",
        "province": "کردستان"
    },
    {
        "text": "چناره",
        "province": "کردستان"
    },
    {
        "text": "دزج",
        "province": "کردستان"
    },
    {
        "text": "دلبران",
        "province": "کردستان"
    },
    {
        "text": "دهگلان",
        "province": "کردستان"
    },
    {
        "text": "دیواندره",
        "province": "کردستان"
    },
    {
        "text": "زرینه",
        "province": "کردستان"
    },
    {
        "text": "سروآباد",
        "province": "کردستان"
    },
    {
        "text": "سریش آباد",
        "province": "کردستان"
    },
    {
        "text": "سقز",
        "province": "کردستان"
    },
    {
        "text": "سنندج",
        "province": "کردستان"
    },
    {
        "text": "شویشه",
        "province": "کردستان"
    },
    {
        "text": "صاحب",
        "province": "کردستان"
    },
    {
        "text": "قروه",
        "province": "کردستان"
    },
    {
        "text": "کامیاران",
        "province": "کردستان"
    },
    {
        "text": "کانی دینار",
        "province": "کردستان"
    },
    {
        "text": "کانی سور",
        "province": "کردستان"
    },
    {
        "text": "مریوان",
        "province": "کردستان"
    },
    {
        "text": "موچش",
        "province": "کردستان"
    },
    {
        "text": "یاسوکند",
        "province": "کردستان"
    },
    {
        "text": "اختیارآباد",
        "province": "کرمان"
    },
    {
        "text": "ارزوئیه",
        "province": "کرمان"
    },
    {
        "text": "امین شهر",
        "province": "کرمان"
    },
    {
        "text": "انار",
        "province": "کرمان"
    },
    {
        "text": "اندوهجرد",
        "province": "کرمان"
    },
    {
        "text": "باغین",
        "province": "کرمان"
    },
    {
        "text": "بافت",
        "province": "کرمان"
    },
    {
        "text": "بردسیر",
        "province": "کرمان"
    },
    {
        "text": "بروات",
        "province": "کرمان"
    },
    {
        "text": "بزنجان",
        "province": "کرمان"
    },
    {
        "text": "بم",
        "province": "کرمان"
    },
    {
        "text": "بهرمان",
        "province": "کرمان"
    },
    {
        "text": "پاریز",
        "province": "کرمان"
    },
    {
        "text": "جبالبارز",
        "province": "کرمان"
    },
    {
        "text": "جوپار",
        "province": "کرمان"
    },
    {
        "text": "جوزم",
        "province": "کرمان"
    },
    {
        "text": "جیرفت",
        "province": "کرمان"
    },
    {
        "text": "چترود",
        "province": "کرمان"
    },
    {
        "text": "خاتون آباد",
        "province": "کرمان"
    },
    {
        "text": "خانوک",
        "province": "کرمان"
    },
    {
        "text": "خورسند",
        "province": "کرمان"
    },
    {
        "text": "درب بهشت",
        "province": "کرمان"
    },
    {
        "text": "دهج",
        "province": "کرمان"
    },
    {
        "text": "رابر",
        "province": "کرمان"
    },
    {
        "text": "راور",
        "province": "کرمان"
    },
    {
        "text": "راین",
        "province": "کرمان"
    },
    {
        "text": "رفسنجان",
        "province": "کرمان"
    },
    {
        "text": "رودبار",
        "province": "کرمان"
    },
    {
        "text": "ریحان شهر",
        "province": "کرمان"
    },
    {
        "text": "زرند",
        "province": "کرمان"
    },
    {
        "text": "زنگی آباد",
        "province": "کرمان"
    },
    {
        "text": "زیدآباد",
        "province": "کرمان"
    },
    {
        "text": "سیرجان",
        "province": "کرمان"
    },
    {
        "text": "شهداد",
        "province": "کرمان"
    },
    {
        "text": "شهربابک",
        "province": "کرمان"
    },
    {
        "text": "صفائیه",
        "province": "کرمان"
    },
    {
        "text": "عنبرآباد",
        "province": "کرمان"
    },
    {
        "text": "فاریاب",
        "province": "کرمان"
    },
    {
        "text": "فهرج",
        "province": "کرمان"
    },
    {
        "text": "قلعه گنج",
        "province": "کرمان"
    },
    {
        "text": "کاظم آباد",
        "province": "کرمان"
    },
    {
        "text": "کرمان",
        "province": "کرمان"
    },
    {
        "text": "کشکوئیه",
        "province": "کرمان"
    },
    {
        "text": "کهنوج",
        "province": "کرمان"
    },
    {
        "text": "کوهبنان",
        "province": "کرمان"
    },
    {
        "text": "کیانشهر",
        "province": "کرمان"
    },
    {
        "text": "گلباف",
        "province": "کرمان"
    },
    {
        "text": "گلزار",
        "province": "کرمان"
    },
    {
        "text": "لاله زار",
        "province": "کرمان"
    },
    {
        "text": "ماهان",
        "province": "کرمان"
    },
    {
        "text": "محمدآباد",
        "province": "کرمان"
    },
    {
        "text": "محی آباد",
        "province": "کرمان"
    },
    {
        "text": "مردهک",
        "province": "کرمان"
    },
    {
        "text": "مس سرچشمه",
        "province": "کرمان"
    },
    {
        "text": "منوجان",
        "province": "کرمان"
    },
    {
        "text": "نجف شهر",
        "province": "کرمان"
    },
    {
        "text": "نرماشیر",
        "province": "کرمان"
    },
    {
        "text": "نظام شهر",
        "province": "کرمان"
    },
    {
        "text": "نگار",
        "province": "کرمان"
    },
    {
        "text": "نودژ",
        "province": "کرمان"
    },
    {
        "text": "هجدک",
        "province": "کرمان"
    },
    {
        "text": "یزدان شهر",
        "province": "کرمان"
    },
    {
        "text": "ازگله",
        "province": "کرمانشاه"
    },
    {
        "text": "اسلام آباد غرب",
        "province": "کرمانشاه"
    },
    {
        "text": "باینگان",
        "province": "کرمانشاه"
    },
    {
        "text": "بیستون",
        "province": "کرمانشاه"
    },
    {
        "text": "پاوه",
        "province": "کرمانشاه"
    },
    {
        "text": "تازه آباد",
        "province": "کرمانشاه"
    },
    {
        "text": "جوان رود",
        "province": "کرمانشاه"
    },
    {
        "text": "حمیل",
        "province": "کرمانشاه"
    },
    {
        "text": "ماهیدشت",
        "province": "کرمانشاه"
    },
    {
        "text": "روانسر",
        "province": "کرمانشاه"
    },
    {
        "text": "سرپل ذهاب",
        "province": "کرمانشاه"
    },
    {
        "text": "سرمست",
        "province": "کرمانشاه"
    },
    {
        "text": "سطر",
        "province": "کرمانشاه"
    },
    {
        "text": "سنقر",
        "province": "کرمانشاه"
    },
    {
        "text": "سومار",
        "province": "کرمانشاه"
    },
    {
        "text": "شاهو",
        "province": "کرمانشاه"
    },
    {
        "text": "صحنه",
        "province": "کرمانشاه"
    },
    {
        "text": "قصرشیرین",
        "province": "کرمانشاه"
    },
    {
        "text": "کرمانشاه",
        "province": "کرمانشاه"
    },
    {
        "text": "کرندغرب",
        "province": "کرمانشاه"
    },
    {
        "text": "کنگاور",
        "province": "کرمانشاه"
    },
    {
        "text": "کوزران",
        "province": "کرمانشاه"
    },
    {
        "text": "گهواره",
        "province": "کرمانشاه"
    },
    {
        "text": "گیلانغرب",
        "province": "کرمانشاه"
    },
    {
        "text": "میان راهان",
        "province": "کرمانشاه"
    },
    {
        "text": "نودشه",
        "province": "کرمانشاه"
    },
    {
        "text": "نوسود",
        "province": "کرمانشاه"
    },
    {
        "text": "هرسین",
        "province": "کرمانشاه"
    },
    {
        "text": "هلشی",
        "province": "کرمانشاه"
    },
    {
        "text": "باشت",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "پاتاوه",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "چرام",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "چیتاب",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "دهدشت",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "دوگنبدان",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "دیشموک",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "سوق",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "سی سخت",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "قلعه رئیسی",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "گراب سفلی",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "لنده",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "لیکک",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "مادوان",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "مارگون",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "یاسوج",
        "province": "کهگیلویه و بویراحمد"
    },
    {
        "text": "انبارآلوم",
        "province": "گلستان"
    },
    {
        "text": "اینچه برون",
        "province": "گلستان"
    },
    {
        "text": "آزادشهر",
        "province": "گلستان"
    },
    {
        "text": "آق قلا",
        "province": "گلستان"
    },
    {
        "text": "بندرترکمن",
        "province": "گلستان"
    },
    {
        "text": "بندرگز",
        "province": "گلستان"
    },
    {
        "text": "جلین",
        "province": "گلستان"
    },
    {
        "text": "خان ببین",
        "province": "گلستان"
    },
    {
        "text": "دلند",
        "province": "گلستان"
    },
    {
        "text": "رامیان",
        "province": "گلستان"
    },
    {
        "text": "سرخنکلاته",
        "province": "گلستان"
    },
    {
        "text": "سیمین شهر",
        "province": "گلستان"
    },
    {
        "text": "علی آباد کتول",
        "province": "گلستان"
    },
    {
        "text": "فاضل آباد",
        "province": "گلستان"
    },
    {
        "text": "کردکوی",
        "province": "گلستان"
    },
    {
        "text": "کلاله",
        "province": "گلستان"
    },
    {
        "text": "گالیکش",
        "province": "گلستان"
    },
    {
        "text": "گرگان",
        "province": "گلستان"
    },
    {
        "text": "گمیش تپه",
        "province": "گلستان"
    },
    {
        "text": "گنبدکاووس",
        "province": "گلستان"
    },
    {
        "text": "مراوه",
        "province": "گلستان"
    },
    {
        "text": "مینودشت",
        "province": "گلستان"
    },
    {
        "text": "نگین شهر",
        "province": "گلستان"
    },
    {
        "text": "نوده خاندوز",
        "province": "گلستان"
    },
    {
        "text": "نوکنده",
        "province": "گلستان"
    },
    {
        "text": "ازنا",
        "province": "لرستان"
    },
    {
        "text": "اشترینان",
        "province": "لرستان"
    },
    {
        "text": "الشتر",
        "province": "لرستان"
    },
    {
        "text": "الیگودرز",
        "province": "لرستان"
    },
    {
        "text": "بروجرد",
        "province": "لرستان"
    },
    {
        "text": "پلدختر",
        "province": "لرستان"
    },
    {
        "text": "چالانچولان",
        "province": "لرستان"
    },
    {
        "text": "چغلوندی",
        "province": "لرستان"
    },
    {
        "text": "چقابل",
        "province": "لرستان"
    },
    {
        "text": "خرم آباد",
        "province": "لرستان"
    },
    {
        "text": "درب گنبد",
        "province": "لرستان"
    },
    {
        "text": "دورود",
        "province": "لرستان"
    },
    {
        "text": "زاغه",
        "province": "لرستان"
    },
    {
        "text": "سپیددشت",
        "province": "لرستان"
    },
    {
        "text": "سراب دوره",
        "province": "لرستان"
    },
    {
        "text": "فیروزآباد",
        "province": "لرستان"
    },
    {
        "text": "کونانی",
        "province": "لرستان"
    },
    {
        "text": "کوهدشت",
        "province": "لرستان"
    },
    {
        "text": "گراب",
        "province": "لرستان"
    },
    {
        "text": "معمولان",
        "province": "لرستان"
    },
    {
        "text": "مومن آباد",
        "province": "لرستان"
    },
    {
        "text": "نورآباد",
        "province": "لرستان"
    },
    {
        "text": "ویسیان",
        "province": "لرستان"
    },
    {
        "text": "احمدسرگوراب",
        "province": "گیلان"
    },
    {
        "text": "اسالم",
        "province": "گیلان"
    },
    {
        "text": "اطاقور",
        "province": "گیلان"
    },
    {
        "text": "املش",
        "province": "گیلان"
    },
    {
        "text": "آستارا",
        "province": "گیلان"
    },
    {
        "text": "آستانه اشرفیه",
        "province": "گیلان"
    },
    {
        "text": "بازار جمعه",
        "province": "گیلان"
    },
    {
        "text": "بره سر",
        "province": "گیلان"
    },
    {
        "text": "بندرانزلی",
        "province": "گیلان"
    },
    {
        "text": "پره سر",
        "province": "گیلان"
    },
    {
        "text": "تالش",
        "province": "گیلان"
    },
    {
        "text": "توتکابن",
        "province": "گیلان"
    },
    {
        "text": "جیرنده",
        "province": "گیلان"
    },
    {
        "text": "چابکسر",
        "province": "گیلان"
    },
    {
        "text": "چاف و چمخاله",
        "province": "گیلان"
    },
    {
        "text": "چوبر",
        "province": "گیلان"
    },
    {
        "text": "حویق",
        "province": "گیلان"
    },
    {
        "text": "خشکبیجار",
        "province": "گیلان"
    },
    {
        "text": "خمام",
        "province": "گیلان"
    },
    {
        "text": "دیلمان",
        "province": "گیلان"
    },
    {
        "text": "رانکوه",
        "province": "گیلان"
    },
    {
        "text": "رحیم آباد",
        "province": "گیلان"
    },
    {
        "text": "رستم آباد",
        "province": "گیلان"
    },
    {
        "text": "رشت",
        "province": "گیلان"
    },
    {
        "text": "رضوانشهر",
        "province": "گیلان"
    },
    {
        "text": "رودبار",
        "province": "گیلان"
    },
    {
        "text": "رودبنه",
        "province": "گیلان"
    },
    {
        "text": "رودسر",
        "province": "گیلان"
    },
    {
        "text": "سنگر",
        "province": "گیلان"
    },
    {
        "text": "سیاهکل",
        "province": "گیلان"
    },
    {
        "text": "شفت",
        "province": "گیلان"
    },
    {
        "text": "شلمان",
        "province": "گیلان"
    },
    {
        "text": "صومعه سرا",
        "province": "گیلان"
    },
    {
        "text": "فومن",
        "province": "گیلان"
    },
    {
        "text": "کلاچای",
        "province": "گیلان"
    },
    {
        "text": "کوچصفهان",
        "province": "گیلان"
    },
    {
        "text": "کومله",
        "province": "گیلان"
    },
    {
        "text": "کیاشهر",
        "province": "گیلان"
    },
    {
        "text": "گوراب زرمیخ",
        "province": "گیلان"
    },
    {
        "text": "لاهیجان",
        "province": "گیلان"
    },
    {
        "text": "لشت نشا",
        "province": "گیلان"
    },
    {
        "text": "لنگرود",
        "province": "گیلان"
    },
    {
        "text": "لوشان",
        "province": "گیلان"
    },
    {
        "text": "لولمان",
        "province": "گیلان"
    },
    {
        "text": "لوندویل",
        "province": "گیلان"
    },
    {
        "text": "لیسار",
        "province": "گیلان"
    },
    {
        "text": "ماسال",
        "province": "گیلان"
    },
    {
        "text": "ماسوله",
        "province": "گیلان"
    },
    {
        "text": "مرجقل",
        "province": "گیلان"
    },
    {
        "text": "منجیل",
        "province": "گیلان"
    },
    {
        "text": "واجارگاه",
        "province": "گیلان"
    },
    {
        "text": "امیرکلا",
        "province": "مازندران"
    },
    {
        "text": "ایزدشهر",
        "province": "مازندران"
    },
    {
        "text": "آلاشت",
        "province": "مازندران"
    },
    {
        "text": "آمل",
        "province": "مازندران"
    },
    {
        "text": "بابل",
        "province": "مازندران"
    },
    {
        "text": "بابلسر",
        "province": "مازندران"
    },
    {
        "text": "بلده",
        "province": "مازندران"
    },
    {
        "text": "بهشهر",
        "province": "مازندران"
    },
    {
        "text": "بهنمیر",
        "province": "مازندران"
    },
    {
        "text": "پل سفید",
        "province": "مازندران"
    },
    {
        "text": "تنکابن",
        "province": "مازندران"
    },
    {
        "text": "جویبار",
        "province": "مازندران"
    },
    {
        "text": "چالوس",
        "province": "مازندران"
    },
    {
        "text": "چمستان",
        "province": "مازندران"
    },
    {
        "text": "خرم آباد",
        "province": "مازندران"
    },
    {
        "text": "خلیل شهر",
        "province": "مازندران"
    },
    {
        "text": "خوش رودپی",
        "province": "مازندران"
    },
    {
        "text": "دابودشت",
        "province": "مازندران"
    },
    {
        "text": "رامسر",
        "province": "مازندران"
    },
    {
        "text": "رستمکلا",
        "province": "مازندران"
    },
    {
        "text": "رویان",
        "province": "مازندران"
    },
    {
        "text": "رینه",
        "province": "مازندران"
    },
    {
        "text": "زرگرمحله",
        "province": "مازندران"
    },
    {
        "text": "زیرآب",
        "province": "مازندران"
    },
    {
        "text": "ساری",
        "province": "مازندران"
    },
    {
        "text": "سرخرود",
        "province": "مازندران"
    },
    {
        "text": "سلمان شهر",
        "province": "مازندران"
    },
    {
        "text": "سورک",
        "province": "مازندران"
    },
    {
        "text": "شیرگاه",
        "province": "مازندران"
    },
    {
        "text": "شیرود",
        "province": "مازندران"
    },
    {
        "text": "عباس آباد",
        "province": "مازندران"
    },
    {
        "text": "فریدونکنار",
        "province": "مازندران"
    },
    {
        "text": "فریم",
        "province": "مازندران"
    },
    {
        "text": "قائم شهر",
        "province": "مازندران"
    },
    {
        "text": "کتالم",
        "province": "مازندران"
    },
    {
        "text": "کلارآباد",
        "province": "مازندران"
    },
    {
        "text": "کلاردشت",
        "province": "مازندران"
    },
    {
        "text": "کله بست",
        "province": "مازندران"
    },
    {
        "text": "کوهی خیل",
        "province": "مازندران"
    },
    {
        "text": "کیاسر",
        "province": "مازندران"
    },
    {
        "text": "کیاکلا",
        "province": "مازندران"
    },
    {
        "text": "گتاب",
        "province": "مازندران"
    },
    {
        "text": "گزنک",
        "province": "مازندران"
    },
    {
        "text": "گلوگاه",
        "province": "مازندران"
    },
    {
        "text": "محمودآباد",
        "province": "مازندران"
    },
    {
        "text": "مرزن آباد",
        "province": "مازندران"
    },
    {
        "text": "مرزیکلا",
        "province": "مازندران"
    },
    {
        "text": "نشتارود",
        "province": "مازندران"
    },
    {
        "text": "نکا",
        "province": "مازندران"
    },
    {
        "text": "نور",
        "province": "مازندران"
    },
    {
        "text": "نوشهر",
        "province": "مازندران"
    },
    {
        "text": "اراک",
        "province": "مرکزی"
    },
    {
        "text": "آستانه",
        "province": "مرکزی"
    },
    {
        "text": "آشتیان",
        "province": "مرکزی"
    },
    {
        "text": "پرندک",
        "province": "مرکزی"
    },
    {
        "text": "تفرش",
        "province": "مرکزی"
    },
    {
        "text": "توره",
        "province": "مرکزی"
    },
    {
        "text": "جاورسیان",
        "province": "مرکزی"
    },
    {
        "text": "خشکرود",
        "province": "مرکزی"
    },
    {
        "text": "خمین",
        "province": "مرکزی"
    },
    {
        "text": "خنداب",
        "province": "مرکزی"
    },
    {
        "text": "داودآباد",
        "province": "مرکزی"
    },
    {
        "text": "دلیجان",
        "province": "مرکزی"
    },
    {
        "text": "رازقان",
        "province": "مرکزی"
    },
    {
        "text": "زاویه",
        "province": "مرکزی"
    },
    {
        "text": "ساروق",
        "province": "مرکزی"
    },
    {
        "text": "ساوه",
        "province": "مرکزی"
    },
    {
        "text": "سنجان",
        "province": "مرکزی"
    },
    {
        "text": "شازند",
        "province": "مرکزی"
    },
    {
        "text": "غرق آباد",
        "province": "مرکزی"
    },
    {
        "text": "فرمهین",
        "province": "مرکزی"
    },
    {
        "text": "قورچی باشی",
        "province": "مرکزی"
    },
    {
        "text": "کرهرود",
        "province": "مرکزی"
    },
    {
        "text": "کمیجان",
        "province": "مرکزی"
    },
    {
        "text": "مامونیه",
        "province": "مرکزی"
    },
    {
        "text": "محلات",
        "province": "مرکزی"
    },
    {
        "text": "مهاجران",
        "province": "مرکزی"
    },
    {
        "text": "میلاجرد",
        "province": "مرکزی"
    },
    {
        "text": "نراق",
        "province": "مرکزی"
    },
    {
        "text": "نوبران",
        "province": "مرکزی"
    },
    {
        "text": "نیمور",
        "province": "مرکزی"
    },
    {
        "text": "هندودر",
        "province": "مرکزی"
    },
    {
        "text": "ابوموسی",
        "province": "هرمزگان"
    },
    {
        "text": "بستک",
        "province": "هرمزگان"
    },
    {
        "text": "بندرجاسک",
        "province": "هرمزگان"
    },
    {
        "text": "بندرچارک",
        "province": "هرمزگان"
    },
    {
        "text": "بندرخمیر",
        "province": "هرمزگان"
    },
    {
        "text": "بندرعباس",
        "province": "هرمزگان"
    },
    {
        "text": "بندرلنگه",
        "province": "هرمزگان"
    },
    {
        "text": "بیکا",
        "province": "هرمزگان"
    },
    {
        "text": "پارسیان",
        "province": "هرمزگان"
    },
    {
        "text": "تخت",
        "province": "هرمزگان"
    },
    {
        "text": "جناح",
        "province": "هرمزگان"
    },
    {
        "text": "حاجی آباد",
        "province": "هرمزگان"
    },
    {
        "text": "درگهان",
        "province": "هرمزگان"
    },
    {
        "text": "دهبارز",
        "province": "هرمزگان"
    },
    {
        "text": "رویدر",
        "province": "هرمزگان"
    },
    {
        "text": "زیارتعلی",
        "province": "هرمزگان"
    },
    {
        "text": "سردشت",
        "province": "هرمزگان"
    },
    {
        "text": "سندرک",
        "province": "هرمزگان"
    },
    {
        "text": "سوزا",
        "province": "هرمزگان"
    },
    {
        "text": "سیریک",
        "province": "هرمزگان"
    },
    {
        "text": "فارغان",
        "province": "هرمزگان"
    },
    {
        "text": "فین",
        "province": "هرمزگان"
    },
    {
        "text": "قشم",
        "province": "هرمزگان"
    },
    {
        "text": "قلعه قاضی",
        "province": "هرمزگان"
    },
    {
        "text": "کنگ",
        "province": "هرمزگان"
    },
    {
        "text": "کوشکنار",
        "province": "هرمزگان"
    },
    {
        "text": "کیش",
        "province": "هرمزگان"
    },
    {
        "text": "گوهران",
        "province": "هرمزگان"
    },
    {
        "text": "میناب",
        "province": "هرمزگان"
    },
    {
        "text": "هرمز",
        "province": "هرمزگان"
    },
    {
        "text": "هشتبندی",
        "province": "هرمزگان"
    },
    {
        "text": "ازندریان",
        "province": "همدان"
    },
    {
        "text": "اسدآباد",
        "province": "همدان"
    },
    {
        "text": "برزول",
        "province": "همدان"
    },
    {
        "text": "بهار",
        "province": "همدان"
    },
    {
        "text": "تویسرکان",
        "province": "همدان"
    },
    {
        "text": "جورقان",
        "province": "همدان"
    },
    {
        "text": "جوکار",
        "province": "همدان"
    },
    {
        "text": "دمق",
        "province": "همدان"
    },
    {
        "text": "رزن",
        "province": "همدان"
    },
    {
        "text": "زنگنه",
        "province": "همدان"
    },
    {
        "text": "سامن",
        "province": "همدان"
    },
    {
        "text": "سرکان",
        "province": "همدان"
    },
    {
        "text": "شیرین سو",
        "province": "همدان"
    },
    {
        "text": "صالح آباد",
        "province": "همدان"
    },
    {
        "text": "فامنین",
        "province": "همدان"
    },
    {
        "text": "فرسفج",
        "province": "همدان"
    },
    {
        "text": "فیروزان",
        "province": "همدان"
    },
    {
        "text": "قروه درجزین",
        "province": "همدان"
    },
    {
        "text": "قهاوند",
        "province": "همدان"
    },
    {
        "text": "کبودر آهنگ",
        "province": "همدان"
    },
    {
        "text": "گل تپه",
        "province": "همدان"
    },
    {
        "text": "گیان",
        "province": "همدان"
    },
    {
        "text": "لالجین",
        "province": "همدان"
    },
    {
        "text": "مریانج",
        "province": "همدان"
    },
    {
        "text": "ملایر",
        "province": "همدان"
    },
    {
        "text": "نهاوند",
        "province": "همدان"
    },
    {
        "text": "همدان",
        "province": "همدان"
    },
    {
        "text": "ابرکوه",
        "province": "یزد"
    },
    {
        "text": "احمدآباد",
        "province": "یزد"
    },
    {
        "text": "اردکان",
        "province": "یزد"
    },
    {
        "text": "اشکذر",
        "province": "یزد"
    },
    {
        "text": "بافق",
        "province": "یزد"
    },
    {
        "text": "بفروئیه",
        "province": "یزد"
    },
    {
        "text": "بهاباد",
        "province": "یزد"
    },
    {
        "text": "تفت",
        "province": "یزد"
    },
    {
        "text": "حمیدیا",
        "province": "یزد"
    },
    {
        "text": "خضرآباد",
        "province": "یزد"
    },
    {
        "text": "دیهوک",
        "province": "یزد"
    },
    {
        "text": "زارچ",
        "province": "یزد"
    },
    {
        "text": "شاهدیه",
        "province": "یزد"
    },
    {
        "text": "طبس",
        "province": "یزد"
    },
    {
        "text": "عقدا",
        "province": "یزد"
    },
    {
        "text": "مروست",
        "province": "یزد"
    },
    {
        "text": "مهردشت",
        "province": "یزد"
    },
    {
        "text": "مهریز",
        "province": "یزد"
    },
    {
        "text": "میبد",
        "province": "یزد"
    },
    {
        "text": "ندوشن",
        "province": "یزد"
    },
    {
        "text": "نیر",
        "province": "یزد"
    },
    {
        "text": "هرات",
        "province": "یزد"
    },
    {
        "text": "یزد",
        "province": "یزد"
    },
    {
        "text": "پرند",
        "province": "تهران"
    },
    {
        "text": "فردیس",
        "province": "البرز"
    },
    {
        "text": "مارلیک",
        "province": "البرز"
    },
    {
        "text": "سادات شهر",
        "province": "مازندران"
    },
    {
        "text": "زیباکنار",
        "province": "گیلان"
    },
    {
        "text": "کردان",
        "province": "البرز"
    },
    {
        "text": "ساوجبلاغ",
        "province": "البرز"
    },
    {
        "text": "تهران دشت",
        "province": "البرز"
    },
    {
        "text": "گلبهار",
        "province": "خراسان رضوی"
    },
    {
        "text": "قیامدشت",
        "province": "تهران"
    },
    {
        "text": "بینالود",
        "province": "خراسان رضوی"
    },
    {
        "text": "پیربازار",
        "province": "گیلان"
    },
    {
        "text": "رضوانشهر",
        "province": "یزد"
    }
]
  export default cities;